src/app/controllers/jobposts_controller.rb

  def index
    @jobposts = Jobpost.all
---
SELECT "jobposts".* FROM "jobposts"

  def create
    @jobpost = Jobpost.new(jobpost_params)
    @jobpost.user = current_user
    respond_to do |format|
      if @jobpost.save
---
INSERT INTO "jobposts" ("title", "description", "jobtype", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Wanting to buy"], ["description", "friendship"], ["jobtype", true], ["created_at", "2019-11-09 02:28:19.889743"], ["updated_at", "2019-11-09 02:28:19.889743"], ["user_id", 1]]

    def set_jobpost
      @jobpost = Jobpost.find(params[:id])
---
SELECT  "jobposts".* FROM "jobposts" WHERE "jobposts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]